logs/average_benchmark_20250710_040145/benchmark_runs/run_02/h3_150ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-10 03:43:42
Delay: 150ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 1000 total requests
spawning thread #1: 5 total client(s). 1000 total requests
spawning thread #2: 5 total client(s). 1000 total requests
spawning thread #3: 5 total client(s). 1000 total requests
spawning thread #4: 5 total client(s). 1000 total requests
spawning thread #5: 5 total client(s). 1000 total requests
spawning thread #6: 5 total client(s). 1000 total requests
spawning thread #7: 5 total client(s). 1000 total requests
spawning thread #8: 5 total client(s). 1000 total requests
spawning thread #9: 5 total client(s). 1000 total requests
spawning thread #10: 5 total client(s). 1000 total requests
spawning thread #11: 5 total client(s). 1000 total requests
spawning thread #12: 5 total client(s). 1000 total requests
spawning thread #13: 5 total client(s). 1000 total requests
spawning thread #14: 5 total client(s). 1000 total requests
spawning thread #15: 5 total client(s). 1000 total requests
spawning thread #16: 5 total client(s). 1000 total requests
spawning thread #17: 5 total client(s). 1000 total requests
spawning thread #18: 5 total client(s). 1000 total requests
spawning thread #19: 5 total client(s). 1000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 490.63ms, 40764.00 req/s, 11.20MB/s
requests: 20000 total, 20000 started, 20000 done, 20000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 20000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 5.50MB (5762632) total, 4.12MB (4318927) headers (space savings 26.80%), 1.18MB (1240000) data
UDP datagram: 3908 sent, 6250 received
                     min         max         mean         sd        +/- sd
time for request:     3.96ms    360.80ms     95.77ms     85.03ms    74.62%
time for connect:    56.84ms     88.08ms     71.98ms     11.99ms    54.00%
time to 1st byte:    67.97ms    354.11ms    161.32ms     97.83ms    85.00%
req/s           :     408.33     1988.28      894.95      504.00    77.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 9000 total requests
spawning thread #1: 5 total client(s). 9000 total requests
spawning thread #2: 5 total client(s). 9000 total requests
spawning thread #3: 5 total client(s). 9000 total requests
spawning thread #4: 5 total client(s). 9000 total requests
spawning thread #5: 5 total client(s). 9000 total requests
spawning thread #6: 5 total client(s). 9000 total requests
spawning thread #7: 5 total client(s). 9000 total requests
spawning thread #8: 5 total client(s). 9000 total requests
spawning thread #9: 5 total client(s). 9000 total requests
spawning thread #10: 5 total client(s). 9000 total requests
spawning thread #11: 5 total client(s). 9000 total requests
spawning thread #12: 5 total client(s). 9000 total requests
spawning thread #13: 5 total client(s). 9000 total requests
spawning thread #14: 5 total client(s). 9000 total requests
spawning thread #15: 5 total client(s). 9000 total requests
spawning thread #16: 5 total client(s). 9000 total requests
spawning thread #17: 5 total client(s). 9000 total requests
spawning thread #18: 5 total client(s). 9000 total requests
spawning thread #19: 5 total client(s). 9000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 13.34s, 13493.32 req/s, 3.73MB/s
requests: 180000 total, 180000 started, 180000 done, 180000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 180000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 49.74MB (52152657) total, 37.22MB (39028629) headers (space savings 26.56%), 10.64MB (11160000) data
UDP datagram: 20953 sent, 43177 received
                     min         max         mean         sd        +/- sd
time for request:     6.92ms       1.64s    666.21ms    240.47ms    69.29%
time for connect:    89.89ms       1.33s    159.23ms    241.38ms    95.00%
time to 1st byte:   103.36ms       1.35s    252.25ms    282.96ms    91.00%
req/s           :     134.98      162.97      139.90        5.84    86.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 20000
Measurement Requests: 180000
End Time: 2025-07-10 03:44:01
CSV Log: /logs/benchmark_20250710_033851/h3_150ms_1pct.csv